Infineon/AURIX_code_examples/code_examples/TC29xTP_BC-step/Project2/Libraries/iLLD/TC29B/Tricore/Scu/Std/IfxScuCcu.h
/**
 * \file IfxScuCcu.h
 * \brief SCU  basic functionality
 * \ingroup IfxLld_Scu
 *
 * \version iLLD_1_0_1_9_0
 * \copyright Copyright (c) 2018 Infineon Technologies AG. All rights reserved.
 *
 *
 *                                 IMPORTANT NOTICE
 *
 *
 * Infineon Technologies AG (Infineon) is supplying this file for use
 * exclusively with Infineon's microcontroller products. This file can be freely
 * distributed within development tools that are supporting such microcontroller
 * products.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 *
 * \defgroup IfxLld_Scu SCU
 * \addtogroup IfxLld_Scu
 * \{
 * \defgroup IfxLld_ScuCcu How to use the Scu Clock driver?
 * \addtogroup IfxLld_ScuCcu
 * \{
 *
 * The Scu Clock control unit driver provides a default configuration for pll and Clock initialisation and set of peripheral clock configuration functions.
 *
 * In the following sections it will be described, how to integrate the driver into the application framework.
 *
 * \section IfxLld_ScuCcu_Std_Preparation Preparation
 * \subsection IfxLld_ScuCcu_Std_Include Include Files
 *
 * Include following header file into your C code:
 * \code
 * #include <Scu/Std/IfxScuCcu.h>
 * \endcode
 *
 * \subsection IfxLld_ScuCcu_Std_Variables Variables
 *
 * Declare the Clock Configuration variables in your C code:
 *
 * \code
 * // used globally
 *
 * // configuration for the PLL  steps
 * static IfxScuCcu_PllStepsConfig IfxScuCcu_testPllConfigSteps[] = {
 *     IFXSCU_CFG_PLL_STEPS
 * };
 *
 *
 * // Default configuration for the Clock Configuration
 * IfxScuCcu_Config                      IfxScuCcu_testClockConfig = {
 *     {
 *        sizeof(IfxScuCcu_testPllConfigSteps) / sizeof(IfxScuCcu_PllStepsConfig),
 *        (IfxScuCcu_PllStepsConfig *)IfxScuCcu_testPllConfigSteps,
 *        IFXSCU_CFG_PLL_INITIAL_STEP,
 *     },
 *     IFXSCU_CFG_CLK_DISTRIBUTION,
 *     IFXSCU_CFG_FLASH_WAITSTATE,
 *     IFX_CFG_SCU_XTAL_FREQUENCY
 * };
 *
 * \endcode
 *
 * \subsection IfxLld_ScuCcu_Std_Init Module Initialisation
 *
 * The module initialisation can be done in the same function. Here an example:
 * \code
 *
 *        // standard PLL & clock initialisation
 *         IfxScuCcu_init(&IfxScuCcu_testClockConfig);
 *
 * \endcode
 *
 *    The PLL and clocks are now initialised based on the IFXSCU_CFG_XTAL_FREQ and  IFXSCU_CFG_PLL_FREQ values configured in Ifx_Cfg.h.
 *
 * \}
 * \}
 *
 * \defgroup IfxLld_Scu_Std_Ccu Ccu Basic Functionality
 * \ingroup IfxLld_Scu_Std
 * \defgroup IfxLld_Scu_Std_Ccu_Ccu Clock Control Functions
 * \ingroup IfxLld_Scu_Std_Ccu
 * \defgroup IfxLld_Scu_Std_Ccu_Ccu_Operative Clock Control Operative Functions
 * \ingroup IfxLld_Scu_Std_Ccu
 * \defgroup IfxLld_Scu_Std_Ccu_Ccu_Configuration Clock Control Configuration Functions
 * \ingroup IfxLld_Scu_Std_Ccu
 * \defgroup IfxLld_Scu_Std_Ccu_Enum Enumerations
 * \ingroup IfxLld_Scu_Std_Ccu
 */

#ifndef IFXSCUCCU_H
#define IFXSCUCCU_H 1

/******************************************************************************/
/*----------------------------------Includes----------------------------------*/
/******************************************************************************/

#include "_Impl/IfxScu_cfg.h"
#include "Scu/Std/IfxScuWdt.h"
#include "Cpu/Std/IfxCpu.h"
#include "IfxStm_reg.h"
#include "IfxScu_reg.h"
#include "IfxFlash_reg.h"
#include "_PinMap/IfxScu_PinMap.h"

/******************************************************************************/
/*-----------------------------------Macros-----------------------------------*/
/******************************************************************************/

/** \brief Oscillator stability check timeout count
 */
#define IFXSCUCCU_OSC_STABLECHK_TIME (640)

/******************************************************************************/
/*------------------------------Type Definitions------------------------------*/
/******************************************************************************/

/** \brief Function pointer type for the hooks
 * \return None
 */
typedef void (*IfxScuCcu_PllStepsFunctionHook)(void);

/******************************************************************************/
/*--------------------------------Enumerations--------------------------------*/
/******************************************************************************/

/** \addtogroup IfxLld_Scu_Std_Ccu_Enum
 * \{ */
/** \brief MODULE_SCU.PLLCON1.B.K1DIV, specifies the K1-Divider
 */
typedef enum
{
    IfxScuCcu_K1divider_1 = 0,      /**< \brief K1-Divider 1  */
    IfxScuCcu_K1divider_2,          /**< \brief K1-Divider 2  */
    IfxScuCcu_K1divider_3,          /**< \brief K1-Divider 3  */
    IfxScuCcu_K1divider_4,          /**< \brief K1-Divider 4  */
    IfxScuCcu_K1divider_5,          /**< \brief K1-Divider 5  */
    IfxScuCcu_K1divider_6,          /**< \brief K1-Divider 6  */
    IfxScuCcu_K1divider_7,          /**< \brief K1-Divider 7  */
    IfxScuCcu_K1divider_8,          /**< \brief K1-Divider 8  */
    IfxScuCcu_K1divider_9,          /**< \brief K1-Divider 9  */
    IfxScuCcu_K1divider_10,         /**< \brief K1-Divider 10  */
    IfxScuCcu_K1divider_11,         /**< \brief K1-Divider 11  */
    IfxScuCcu_K1divider_12,         /**< \brief K1-Divider 12  */
    IfxScuCcu_K1divider_13,         /**< \brief K1-Divider 13  */
    IfxScuCcu_K1divider_14,         /**< \brief K1-Divider 14  */
    IfxScuCcu_K1divider_15,         /**< \brief K1-Divider 15  */
    IfxScuCcu_K1divider_16,         /**< \brief K1-Divider 16  */
    IfxScuCcu_K1divider_17,         /**< \brief K1-Divider 17  */
    IfxScuCcu_K1divider_18,         /**< \brief K1-Divider 18  */
    IfxScuCcu_K1divider_19,         /**< \brief K1-Divider 19  */
    IfxScuCcu_K1divider_20,         /**< \brief K1-Divider 20  */
    IfxScuCcu_K1divider_21,         /**< \brief K1-Divider 21  */
    IfxScuCcu_K1divider_22,         /**< \brief K1-Divider 22  */
    IfxScuCcu_K1divider_23,         /**< \brief K1-Divider 23  */
    IfxScuCcu_K1divider_24,         /**< \brief K1-Divider 24  */
    IfxScuCcu_K1divider_25,         /**< \brief K1-Divider 25  */
    IfxScuCcu_K1divider_26,         /**< \brief K1-Divider 26  */
    IfxScuCcu_K1divider_27,         /**< \brief K1-Divider 27  */
    IfxScuCcu_K1divider_28,         /**< \brief K1-Divider 28  */
    IfxScuCcu_K1divider_29,         /**< \brief K1-Divider 29  */
    IfxScuCcu_K1divider_30,         /**< \brief K1-Divider 30  */
    IfxScuCcu_K1divider_31,         /**< \brief K1-Divider 31  */
    IfxScuCcu_K1divider_32,         /**< \brief K1-Divider 32  */
    IfxScuCcu_K1divider_33,         /**< \brief K1-Divider 33  */
    IfxScuCcu_K1divider_34,         /**< \brief K1-Divider 34  */
    IfxScuCcu_K1divider_35,         /**< \brief K1-Divider 35  */
    IfxScuCcu_K1divider_36,         /**< \brief K1-Divider 36  */
    IfxScuCcu_K1divider_37,         /**< \brief K1-Divider 37  */
    IfxScuCcu_K1divider_38,         /**< \brief K1-Divider 38  */
    IfxScuCcu_K1divider_39,         /**< \brief K1-Divider 39  */
    IfxScuCcu_K1divider_40,         /**< \brief K1-Divider 40  */
    IfxScuCcu_K1divider_41,         /**< \brief K1-Divider 41  */
    IfxScuCcu_K1divider_42,         /**< \brief K1-Divider 42  */
    IfxScuCcu_K1divider_43,         /**< \brief K1-Divider 43  */
    IfxScuCcu_K1divider_44,         /**< \brief K1-Divider 44  */
    IfxScuCcu_K1divider_45,         /**< \brief K1-Divider 45  */
    IfxScuCcu_K1divider_46,         /**< \brief K1-Divider 46  */
    IfxScuCcu_K1divider_47,         /**< \brief K1-Divider 47  */
    IfxScuCcu_K1divider_48,         /**< \brief K1-Divider 48  */
    IfxScuCcu_K1divider_49,         /**< \brief K1-Divider 49  */
    IfxScuCcu_K1divider_50,         /**< \brief K1-Divider 50  */
    IfxScuCcu_K1divider_51,         /**< \brief K1-Divider 51  */
    IfxScuCcu_K1divider_52,         /**< \brief K1-Divider 52  */
    IfxScuCcu_K1divider_53,         /**< \brief K1-Divider 53  */
    IfxScuCcu_K1divider_54,         /**< \brief K1-Divider 54  */
    IfxScuCcu_K1divider_55,         /**< \brief K1-Divider 55  */
    IfxScuCcu_K1divider_56,         /**< \brief K1-Divider 56  */
    IfxScuCcu_K1divider_57,         /**< \brief K1-Divider 57  */
    IfxScuCcu_K1divider_58,         /**< \brief K1-Divider 58  */
    IfxScuCcu_K1divider_59,         /**< \brief K1-Divider 59  */
    IfxScuCcu_K1divider_60,         /**< \brief K1-Divider 60  */
    IfxScuCcu_K1divider_61,         /**< \brief K1-Divider 61  */
    IfxScuCcu_K1divider_62,         /**< \brief K1-Divider 62  */
    IfxScuCcu_K1divider_63,         /**< \brief K1-Divider 63  */
    IfxScuCcu_K1divider_64,         /**< \brief K1-Divider 64  */
    IfxScuCcu_K1divider_65,         /**< \brief K1-Divider 65  */
    IfxScuCcu_K1divider_66,         /**< \brief K1-Divider 66  */
    IfxScuCcu_K1divider_67,         /**< \brief K1-Divider 67  */
    IfxScuCcu_K1divider_68,         /**< \brief K1-Divider 68  */
    IfxScuCcu_K1divider_69,         /**< \brief K1-Divider 69  */
    IfxScuCcu_K1divider_70,         /**< \brief K1-Divider 70  */
    IfxScuCcu_K1divider_71,         /**< \brief K1-Divider 71  */
    IfxScuCcu_K1divider_72,         /**< \brief K1-Divider 72  */
    IfxScuCcu_K1divider_73,         /**< \brief K1-Divider 73  */
    IfxScuCcu_K1divider_74,         /**< \brief K1-Divider 74  */
    IfxScuCcu_K1divider_75,         /**< \brief K1-Divider 75  */
    IfxScuCcu_K1divider_76,         /**< \brief K1-Divider 76  */
    IfxScuCcu_K1divider_77,         /**< \brief K1-Divider 77  */
    IfxScuCcu_K1divider_78,         /**< \brief K1-Divider 78  */
    IfxScuCcu_K1divider_79,         /**< \brief K1-Divider 79  */
    IfxScuCcu_K1divider_80,         /**< \brief K1-Divider 80  */
    IfxScuCcu_K1divider_81,         /**< \brief K1-Divider 81  */
    IfxScuCcu_K1divider_82,         /**< \brief K1-Divider 82  */
    IfxScuCcu_K1divider_83,         /**< \brief K1-Divider 83  */
    IfxScuCcu_K1divider_84,         /**< \brief K1-Divider 84  */
    IfxScuCcu_K1divider_85,         /**< \brief K1-Divider 85  */
    IfxScuCcu_K1divider_86,         /**< \brief K1-Divider 86  */
    IfxScuCcu_K1divider_87,         /**< \brief K1-Divider 87  */
    IfxScuCcu_K1divider_88,         /**< \brief K1-Divider 88  */
    IfxScuCcu_K1divider_89,         /**< \brief K1-Divider 89  */
    IfxScuCcu_K1divider_90,         /**< \brief K1-Divider 90  */
    IfxScuCcu_K1divider_91,         /**< \brief K1-Divider 91  */
    IfxScuCcu_K1divider_92,         /**< \brief K1-Divider 92  */
    IfxScuCcu_K1divider_93,         /**< \brief K1-Divider 93  */
    IfxScuCcu_K1divider_94,         /**< \brief K1-Divider 94  */
    IfxScuCcu_K1divider_95,         /**< \brief K1-Divider 95  */
    IfxScuCcu_K1divider_96,         /**< \brief K1-Divider 96  */
    IfxScuCcu_K1divider_97,         /**< \brief K1-Divider 97  */
    IfxScuCcu_K1divider_98,         /**< \brief K1-Divider 98  */
    IfxScuCcu_K1divider_99,         /**< \brief K1-Divider 99  */
    IfxScuCcu_K1divider_100,        /**< \brief K1-Divider 100  */
    IfxScuCcu_K1divider_101,        /**< \brief K1-Divider 101  */
    IfxScuCcu_K1divider_102,        /**< \brief K1-Divider 102  */
    IfxScuCcu_K1divider_103,        /**< \brief K1-Divider 103  */
    IfxScuCcu_K1divider_104,        /**< \brief K1-Divider 104  */
    IfxScuCcu_K1divider_105,        /**< \brief K1-Divider 105  */
    IfxScuCcu_K1divider_106,        /**< \brief K1-Divider 106  */
    IfxScuCcu_K1divider_107,        /**< \brief K1-Divider 107  */
    IfxScuCcu_K1divider_108,        /**< \brief K1-Divider 108  */
    IfxScuCcu_K1divider_109,        /**< \brief K1-Divider 109  */
    IfxScuCcu_K1divider_110,        /**< \brief K1-Divider 110  */
    IfxScuCcu_K1divider_111,        /**< \brief K1-Divider 111  */
    IfxScuCcu_K1divider_112,        /**< \brief K1-Divider 112  */
    IfxScuCcu_K1divider_113,        /**< \brief K1-Divider 113  */
    IfxScuCcu_K1divider_114,        /**< \brief K1-Divider 114  */
    IfxScuCcu_K1divider_115,        /**< \brief K1-Divider 115  */
    IfxScuCcu_K1divider_116,        /**< \brief K1-Divider 116  */
    IfxScuCcu_K1divider_117,        /**< \brief K1-Divider 117  */
    IfxScuCcu_K1divider_118,        /**< \brief K1-Divider 118  */
    IfxScuCcu_K1divider_119,        /**< \brief K1-Divider 119  */
    IfxScuCcu_K1divider_120,        /**< \brief K1-Divider 120  */
    IfxScuCcu_K1divider_121,        /**< \brief K1-Divider 121  */
    IfxScuCcu_K1divider_122,        /**< \brief K1-Divider 122  */
    IfxScuCcu_K1divider_123,        /**< \brief K1-Divider 123  */
    IfxScuCcu_K1divider_124,        /**< \brief K1-Divider 124  */
    IfxScuCcu_K1divider_125,        /**< \brief K1-Divider 125  */
    IfxScuCcu_K1divider_126,        /**< \brief K1-Divider 126  */
    IfxScuCcu_K1divider_127,        /**< \brief K1-Divider 127  */
    IfxScuCcu_K1divider_128         /**< \brief K1-Divider 128  */
} IfxScuCcu_K1divider;

/** \brief MODULE_SCU.PLLCON1.B.K2DIV, specifies the K2-Divider
 */
typedef enum
{
    IfxScuCcu_K2divider_1 = 0,      /**< \brief K2-Divider 1  */
    IfxScuCcu_K2divider_2,          /**< \brief K2-Divider 2  */
    IfxScuCcu_K2divider_3,          /**< \brief K2-Divider 3  */
    IfxScuCcu_K2divider_4,          /**< \brief K2-Divider 4  */
    IfxScuCcu_K2divider_5,          /**< \brief K2-Divider 5  */
    IfxScuCcu_K2divider_6,          /**< \brief K2-Divider 6  */
    IfxScuCcu_K2divider_7,          /**< \brief K2-Divider 7  */
    IfxScuCcu_K2divider_8,          /**< \brief K2-Divider 8  */
    IfxScuCcu_K2divider_9,          /**< \brief K2-Divider 9  */
    IfxScuCcu_K2divider_10,         /**< \brief K2-Divider 10  */
    IfxScuCcu_K2divider_11,         /**< \brief K2-Divider 11  */
    IfxScuCcu_K2divider_12,         /**< \brief K2-Divider 12  */
    IfxScuCcu_K2divider_13,         /**< \brief K2-Divider 13  */
    IfxScuCcu_K2divider_14,         /**< \brief K2-Divider 14  */
    IfxScuCcu_K2divider_15,         /**< \brief K2-Divider 15  */
    IfxScuCcu_K2divider_16,         /**< \brief K2-Divider 16  */
    IfxScuCcu_K2divider_17,         /**< \brief K2-Divider 17  */
    IfxScuCcu_K2divider_18,         /**< \brief K2-Divider 18  */
    IfxScuCcu_K2divider_19,         /**< \brief K2-Divider 19  */
    IfxScuCcu_K2divider_20,         /**< \brief K2-Divider 20  */
    IfxScuCcu_K2divider_21,         /**< \brief K2-Divider 21  */
    IfxScuCcu_K2divider_22,         /**< \brief K2-Divider 22  */
    IfxScuCcu_K2divider_23,         /**< \brief K2-Divider 23  */
    IfxScuCcu_K2divider_24,         /**< \brief K2-Divider 24  */
    IfxScuCcu_K2divider_25,         /**< \brief K2-Divider 25  */
    IfxScuCcu_K2divider_26,         /**< \brief K2-Divider 26  */
    IfxScuCcu_K2divider_27,         /**< \brief K2-Divider 27  */
    IfxScuCcu_K2divider_28,         /**< \brief K2-Divider 28  */
    IfxScuCcu_K2divider_29,         /**< \brief K2-Divider 29  */
    IfxScuCcu_K2divider_30,         /**< \brief K2-Divider 30  */
    IfxScuCcu_K2divider_31,         /**< \brief K2-Divider 31  */
    IfxScuCcu_K2divider_32,         /**< \brief K2-Divider 32  */
    IfxScuCcu_K2divider_33,         /**< \brief K2-Divider 33  */
    IfxScuCcu_K2divider_34,         /**< \brief K2-Divider 34  */
    IfxScuCcu_K2divider_35,         /**< \brief K2-Divider 35  */
    IfxScuCcu_K2divider_36,         /**< \brief K2-Divider 36  */
    IfxScuCcu_K2divider_37,         /**< \brief K2-Divider 37  */
    IfxScuCcu_K2divider_38,         /**< \brief K2-Divider 38  */
    IfxScuCcu_K2divider_39,         /**< \brief K2-Divider 39  */
    IfxScuCcu_K2divider_40,         /**< \brief K2-Divider 40  */
    IfxScuCcu_K2divider_41,         /**< \brief K2-Divider 41  */
    IfxScuCcu_K2divider_42,         /**< \brief K2-Divider 42  */
    IfxScuCcu_K2divider_43,         /**< \brief K2-Divider 43  */
    IfxScuCcu_K2divider_44,         /**< \brief K2-Divider 44  */
    IfxScuCcu_K2divider_45,         /**< \brief K2-Divider 45  */
    IfxScuCcu_K2divider_46,         /**< \brief K2-Divider 46  */
    IfxScuCcu_K2divider_47,         /**< \brief K2-Divider 47  */
    IfxScuCcu_K2divider_48,         /**< \brief K2-Divider 48  */
    IfxScuCcu_K2divider_49,         /**< \brief K2-Divider 49  */
    IfxScuCcu_K2divider_50,         /**< \brief K2-Divider 50  */
    IfxScuCcu_K2divider_51,         /**< \brief K2-Divider 51  */
    IfxScuCcu_K2divider_52,         /**< \brief K2-Divider 52  */
    IfxScuCcu_K2divider_53,         /**< \brief K2-Divider 53  */
    IfxScuCcu_K2divider_54,         /**< \brief K2-Divider 54  */
    IfxScuCcu_K2divider_55,         /**< \brief K2-Divider 55  */
    IfxScuCcu_K2divider_56,         /**< \brief K2-Divider 56  */
    IfxScuCcu_K2divider_57,         /**< \brief K2-Divider 57  */
    IfxScuCcu_K2divider_58,         /**< \brief K2-Divider 58  */
    IfxScuCcu_K2divider_59,         /**< \brief K2-Divider 59  */
    IfxScuCcu_K2divider_60,         /**< \brief K2-Divider 60  */
    IfxScuCcu_K2divider_61,         /**< \brief K2-Divider 61  */
    IfxScuCcu_K2divider_62,         /**< \brief K2-Divider 62  */
    IfxScuCcu_K2divider_63,         /**< \brief K2-Divider 63  */
    IfxScuCcu_K2divider_64,         /**< \brief K2-Divider 64  */
    IfxScuCcu_K2divider_65,         /**< \brief K2-Divider 65  */
    IfxScuCcu_K2divider_66,         /**< \brief K2-Divider 66  */
    IfxScuCcu_K2divider_67,         /**< \brief K2-Divider 67  */
    IfxScuCcu_K2divider_68,         /**< \brief K2-Divider 68  */
    IfxScuCcu_K2divider_69,         /**< \brief K2-Divider 69  */
    IfxScuCcu_K2divider_70,         /**< \brief K2-Divider 70  */
    IfxScuCcu_K2divider_71,         /**< \brief K2-Divider 71  */
    IfxScuCcu_K2divider_72,         /**< \brief K2-Divider 72  */
    IfxScuCcu_K2divider_73,         /**< \brief K2-Divider 73  */
    IfxScuCcu_K2divider_74,         /**< \brief K2-Divider 74  */
    IfxScuCcu_K2divider_75,         /**< \brief K2-Divider 75  */
    IfxScuCcu_K2divider_76,         /**< \brief K2-Divider 76  */
    IfxScuCcu_K2divider_77,         /**< \brief K2-Divider 77  */
    IfxScuCcu_K2divider_78,         /**< \brief K2-Divider 78  */
    IfxScuCcu_K2divider_79,         /**< \brief K2-Divider 79  */
    IfxScuCcu_K2divider_80,         /**< \brief K2-Divider 80  */
    IfxScuCcu_K2divider_81,         /**< \brief K2-Divider 81  */
    IfxScuCcu_K2divider_82,         /**< \brief K2-Divider 82  */
    IfxScuCcu_K2divider_83,         /**< \brief K2-Divider 83  */
    IfxScuCcu_K2divider_84,         /**< \brief K2-Divider 84  */
    IfxScuCcu_K2divider_85,         /**< \brief K2-Divider 85  */
    IfxScuCcu_K2divider_86,         /**< \brief K2-Divider 86  */
    IfxScuCcu_K2divider_87,         /**< \brief K2-Divider 87  */
    IfxScuCcu_K2divider_88,         /**< \brief K2-Divider 88  */
    IfxScuCcu_K2divider_89,         /**< \brief K2-Divider 89  */
    IfxScuCcu_K2divider_90,         /**< \brief K2-Divider 90  */
    IfxScuCcu_K2divider_91,         /**< \brief K2-Divider 91  */
    IfxScuCcu_K2divider_92,         /**< \brief K2-Divider 92  */
    IfxScuCcu_K2divider_93,         /**< \brief K2-Divider 93  */
    IfxScuCcu_K2divider_94,         /**< \brief K2-Divider 94  */
    IfxScuCcu_K2divider_95,         /**< \brief K2-Divider 95  */
    IfxScuCcu_K2divider_96,         /**< \brief K2-Divider 96  */
    IfxScuCcu_K2divider_97,         /**< \brief K2-Divider 97  */
    IfxScuCcu_K2divider_98,         /**< \brief K2-Divider 98  */
    IfxScuCcu_K2divider_99,         /**< \brief K2-Divider 99  */
    IfxScuCcu_K2divider_100,        /**< \brief K2-Divider 100  */
    IfxScuCcu_K2divider_101,        /**< \brief K2-Divider 101  */
    IfxScuCcu_K2divider_102,        /**< \brief K2-Divider 102  */
    IfxScuCcu_K2divider_103,        /**< \brief K2-Divider 103  */
    IfxScuCcu_K2divider_104,        /**< \brief K2-Divider 104  */
    IfxScuCcu_K2divider_105,        /**< \brief K2-Divider 105  */
    IfxScuCcu_K2divider_106,        /**< \brief K2-Divider 106  */
    IfxScuCcu_K2divider_107,        /**< \brief K2-Divider 107  */
    IfxScuCcu_K2divider_108,        /**< \brief K2-Divider 108  */
    IfxScuCcu_K2divider_109,        /**< \brief K2-Divider 109  */
    IfxScuCcu_K2divider_110,        /**< \brief K2-Divider 110  */
    IfxScuCcu_K2divider_111,        /**< \brief K2-Divider 111  */
    IfxScuCcu_K2divider_112,        /**< \brief K2-Divider 112  */
    IfxScuCcu_K2divider_113,        /**< \brief K2-Divider 113  */
    IfxScuCcu_K2divider_114,        /**< \brief K2-Divider 114  */
    IfxScuCcu_K2divider_115,        /**< \brief K2-Divider 115  */
    IfxScuCcu_K2divider_116,        /**< \brief K2-Divider 116  */
    IfxScuCcu_K2divider_117,        /**< \brief K2-Divider 117  */
    IfxScuCcu_K2divider_118,        /**< \brief K2-Divider 118  */
    IfxScuCcu_K2divider_119,        /**< \brief K2-Divider 119  */
    IfxScuCcu_K2divider_120,        /**< \brief K2-Divider 120  */
    IfxScuCcu_K2divider_121,        /**< \brief K2-Divider 121  */
    IfxScuCcu_K2divider_122,        /**< \brief K2-Divider 122  */
    IfxScuCcu_K2divider_123,        /**< \brief K2-Divider 123  */
    IfxScuCcu_K2divider_124,        /**< \brief K2-Divider 124  */
    IfxScuCcu_K2divider_125,        /**< \brief K2-Divider 125  */
    IfxScuCcu_K2divider_126,        /**< \brief K2-Divider 126  */
    IfxScuCcu_K2divider_127,        /**< \brief K2-Divider 127  */
    IfxScuCcu_K2divider_128         /**< \brief K2-Divider 128  */
} IfxScuCcu_K2divider;

